using System;
using Floyd.GraphPatterns;

namespace Floyd
{
    class Program
    {
        static void Main(string[] args)
        {
            int[,] array = new int[,] // Создание двумерного массива 
            //Матрица смежности для применения Алгоритма Флойда
           {{0,1000,6,7,1000,8,1000,1000},
            {1000,0,1,3,1000,2,4,1000},
            {6,1,0,1000,1000,1000,1000,7},
            {7,3,1000,0,9,1000,1000,1000},
            {1000,1000,1000,9,0,1000,5,1000},
            {6,2,1000,1000,1000,0,1000,3},
           {1000,4,1000,1000,5,1000,0,4 },
           {1000,1000,7,1000,1000,3,4,0 } };

            Floyd floyd = new Floyd(array);
            floyd.Show();
        }
    }
}
